# -*- coding: utf8 -*-

from data import db_session
from data.regular_table import RegularTable
from data.users import Users

db_session.global_init()

table_markers = [
    ['Реклама курсов',
     '(?i)(?:бес)?платн(?:ые|ый|ых)\\s(?:мини)?курс(?:ы|ов|ам|а)?|(?:мини)?курс(?:е|ах)?\\s«[\\w\\-_0-9]*»|доступ\\s[\\s\\w]*(?:мини)?курс(?:ы|ов|ам|а|у)?|курс(?:ы|ов|ам|а)?\\s(?:по\\sссылке)|подарок\\sкурс[ы]?|(?:мини)?курс\\sпо',
     '2.0'],
    ['Реклама курсов', '(?i)(?:бес)?платн(?:ые|ый|ых)\\sкурс(?:ы|ов|ам|а)?|курс(?:е|ах)?\\s«[\\w\\-_0-9]*»', '1.0'],
    ['Реклама курсов',
     '(?i)(?:бес)?платн(?:ые|ый|ых)\\s(?:мини)?курс(?:ы|ов|ам|а)?|(?:мини)?курс(?:е|ах)?\\s«[\\w\\-_0-9]*»|доступ\\s[\\s\\w]*(?:мини)?курс(?:ы|ов|ам|а|у)?|курс(?:ы|ов|ам|а)?\\s(?:по\\sссылке)|подар(?:ить|ок)\\sкурс(?:ы|ов)?|(?:мини)?курс[ы]?\\s(?:про|по)',
     '2.1'], ['Реклама курсов',
              '(?i)(?:бес)?платн(?:ые|ый|ых)\\s(?:мини)?курс(?:ы|ов|ам|а)?|(?:мини)?курс(?:е|ах)?\\s«[\\w\\-_0-9]*»|доступ\\s[\\s\\w]*(?:мини)?курс(?:ы|ов|ам|а|у)?|курс(?:ы|ов|ам|а)?\\s(?:по\\sссылке)|подар(?:ить|ок)\\sкурс(?:ы|ов)?|(?:мини)?курс[ы]?\\s(?:про|по)|онлайн[-\\s](?:курс(?:ы|ов|ам|а)?|школ(?:ы|ов|ам|а|у)?)',
              '3.2'], ['Реклама курсов',
                       '(?i)(?:бес)?платн(?:ые|ый|ых)\\s(?:мини)?курс(?:ы|ов|ам|а)?|(?:мини)?курс(?:е|ах)?\\s«[\\w\\-_0-9]*»|доступ\\s[\\s\\w]*(?:мини)?курс(?:ы|ов|ам|а|у)?|курс(?:ы|ов|ам|а)?\\s(?:по\\sссылке)|подар(?:ить|ок)\\sкурс(?:ы|ов)?|(?:мини)?курс[ы]?\\s(?:про|по)|онлайн[-\\s](?:курс(?:ы|ов|ам|а)?|школ(?:ы|ов|ам|а|у)?)|(?:запис(?:ывайся|ывайтесь|ь)|набор)\\sна\\s(?:обучение|курс[ы]?)|курс[ы]?[\\w\\s]*?языка|курс[ы]?[\\w\\s-]*от|(?:мини)?курс(?:а|ы)?[\\s\\w]*(?:научит(?:ь|есь)?|научат)',
                       '5.1'], ['Реклама курсов',
                                '(?i)(?:бес)?платн(?:ые|ый|ых)\\s(?:мини)?курс(?:ы|ов|ам|а)?|(?:мини)?курс(?:е|ах)?\\s«[\\w\\-_0-9]*»|доступ\\s[\\s\\w]*(?:мини)?курс(?:ы|ов|ам|а|у)?|курс(?:ы|ов|ам|а)?\\s(?:по\\sссылке)|подар(?:ить|ок)\\sкурс(?:ы|ов)?|(?:мини)?курс[ы]?\\s(?:про|по)|онлайн-курс(?:ы|ов|ам|а)?',
                                '3.0'], ['Реклама тг-каналов',
                                         '(?i)(?:телеграм|telegram|tg|тг)[\\s-]канал[еы]?|t\\.me|(?<!ютуб[\\s-])канал(?:ы|ов)?\\s(?:с|про|по)|наш(?:[её]л|ла)[\\s\\w]*канал',
                                         '2.1'],
    ['Реклама тг-каналов', '(?i)(?:телеграм|telegram|tg|тг)[\\s-]канал[еы]?', '1.0'], ['Реклама тг-каналов',
                                                                                       '(?i)(?:телеграм|telegram|tg|тг)[\\s-]канал[еы]?|t\\.me|канал(?:ы|ов)?\\s(?:с|про|по)|наш(?:ел|ла)[\\s\\w]*канал',
                                                                                       '2.0'], ['Реклама тг-каналов',
                                                                                                '(?i)(?:телеграм|telegram|tg|тг)[\\s-]канал[еы]?|t\\.me|(?<!ютуб[\\s-])канал(?:ы|ов)?\\s(?:с|про|по|для)\\b|на(?:ш[её]л|шла|йден)[\\s\\w]*канал[ы]?',
                                                                                                '2.2'],
    ['Реклама тг-каналов',
     '(?i)(?:телеграм|telegram|tg|тг)[\\s-]канал[еы]?|t\\.me|(?<!ютуб[\\s-])канал(?:ы|ов)?\\s(?:с|про|по|для)\\b(?![\\s\\w]*телевизор)|на(?:ш[её]л|шла|йден)[\\s\\w]*канал[ы]?(?![\\s\\w]*(?:телевизор|TV))',
     '2.3'], ['Реклама товаров на маркетплейсах',
              '(?i)\\bлот\\b|артикул|скидк(?:и|ой)[\\s\\w]*до\\s[\\d]{1,2}%|распродажа|выгода|(?<=цена)[\\w\\s]*до\\s\\d{1,2}%',
              '2.0'], ['Реклама товаров на маркетплейсах', '(?i)\\bлот\\b|артикул|скидки\\sдо\\s[\\d]{1,2}%', '1.0'],
    ['Реклама товаров на маркетплейсах', '(?i)\\bлот\\b|артикул|скидк(?:и|ой)[\\s\\w]*до\\s[\\d]{1,2}%', '1.1'],
    ['Реклама курсов',
     '(?i)(?:бес)?платн(?:ые|ый|ых)\\s(?:мини)?курс(?:ы|ов|ам|а)?|(?:мини)?курс(?:е|ах)?\\s«[\\w\\-_0-9]*»|доступ\\s[\\s\\w]*(?:мини)?курс(?:ы|ов|ам|а|у)?|курс(?:ы|ов|ам|а)?\\s(?:по\\sссылке)|подар(?:ить|ок)\\sкурс(?:ы|ов)?|(?:мини)?курс[ы]?\\s(?:про|по)|онлайн[-\\s](?:курс(?:ы|ов|ам|а)?|школ(?:ы|ов|ам|а|у)?)|запис(?:ывайся|ывайтесь|ь)\\sна(?:мини)?\\sкурс',
     '4.0'], ['Реклама курсов',
              '(?i)(?:бес)?платн(?:ые|ый|ых)\\s(?:мини)?курс(?:ы|ов|ам|а)?|(?:мини)?курс(?:е|ах)?\\s«[\\w\\-_0-9]*»|доступ\\s[\\s\\w]*(?:мини)?курс(?:ы|ов|ам|а|у)?|курс(?:ы|ов|ам|а)?\\s(?:по\\sссылке)|подар(?:ить|ок)\\sкурс(?:ы|ов)?|(?:мини)?курс[ы]?\\s(?:про|по)|онлайн[-\\s](?:курс(?:ы|ов|ам|а)?|школ(?:ы|ов|ам|а|у)?)|(?:запис(?:ывайся|ывайтесь|ь)|набор)\\sна\\s(?:мини)?\\s?курс',
              '4.1'], ['Реклама курсов',
                       '(?i)(?:бес)?платн(?:ые|ый|ых)\\s(?:мини)?курс(?:ы|ов|ам|а)?|(?:мини)?курс(?:е|ах)?\\s«[\\w\\-_0-9]*»',
                       '1.1'], ['Реклама курсов',
                                '(?i)(?:бес)?платн(?:ые|ый|ых)\\s(?:мини)?курс(?:ы|ов|ам|а)?|(?:мини)?курс(?:е|ах)?\\s«[\\w\\-_0-9]*»|доступ\\s[\\s\\w]*(?:мини)?курс(?:ы|ов|ам|а|у)?|курс(?:ы|ов|ам|а)?\\s(?:по\\sссылке)|подар(?:ить|ок)\\sкурс(?:ы|ов)?|(?:мини)?курс[ы]?\\s(?:про|по)|онлайн[-\\s](?:курс(?:ы|ов|ам|а)?|школ(?:ы|ов|ам|а|у)?)|(?:запис(?:ывайся|ывайтесь|ь)|набор)\\sна\\s(?:обучение|курс[ы]?)',
                                '4.2'], ['Реклама курсов',
                                         '(?i)(?:бес)?платн(?:ые|ый|ых)\\s(?:мини)?курс(?:ы|ов|ам|а)?|(?:мини)?курс(?:е|ах)?\\s«[\\w\\-_0-9]*»|доступ\\s[\\s\\w]*(?:мини)?курс(?:ы|ов|ам|а|у)?|курс(?:ы|ов|ам|а)?\\s(?:по\\sссылке)|подар(?:ить|ок)\\sкурс(?:ы|ов)?|(?:мини)?курс[ы]?\\s(?:про|по)|онлайн[-\\s](?:курс(?:ы|ов|ам|а)?|школ(?:ы|ов|ам|а|у)?)|(?:запис(?:ывайся|ывайтесь|ь)|набор)\\sна\\s(?:обучение|курс[ы]?)|курс[ы]?[\\w\\s]*?языка|курс[ы]?[\\w\\s-]*от|(?:мини)?курс[ы]?[\\s\\w]*научит[ь]?',
                                         '5.0'], ['Реклама тг-каналов',
                                                  '(?i)(?:телеграм|telegram|tg|тг)[\\s-]канал[еы]?|t\\.me|(?<!ютуб[\\s-])канал(?:ы|ов)?\\s(?:с|про|по|для)\\b(?![\\s\\w]*телевизор)|на(?:ш[её]л|шла|йден)[\\s\\w]*канал[ы]?(?![\\s\\w]*(?:телевизор|TV))|(?:канал\\s)?@\\w*(?!.*\\.)|канал\\s«\\w*»|канал\\sв\\s(?:телеграм|telegram|tg|тг)|канал(?=[\\w\\s,.!\\.]*подписывайтесь)',
                                                  '3.0'], ['Реклама тг-каналов',
                                                           '(?i)(?:телеграм|telegram|tg|тг)[\\s-]канал[еы]?|t\\.me|(?<!ютуб[\\s-])канал(?:ы|ов)?\\s(?:с|про|по|для)\\b(?![\\s\\w]*телевизор)|на(?:ш[её]л|шла|йден)[\\s\\w]*канал[ы]?(?![\\s\\w]*(?:телевизор|TV))|(?:канал[е]?\\s)?@\\w*(?!.*\\.)|канал\\s«\\w*»|канал[ы]?\\sв\\s(?:телеграм|telegram|tg|тг)|канал(?=[\\w\\s,.!\\.]*подписывай(?:тесь|ся))',
                                                           '3.1'], ['Реклама тг-каналов',
                                                                    '(?i)(?:телеграм|telegram|tg|тг)[\\s-]канал[еы]?|t\\.me|(?<!ютуб[\\s-])канал(?:ы|ов)?\\s(?:с|про|по|для)\\b(?![\\s\\w]*телевизор)|на(?:ш[её]л|шла|йден)[\\s\\w]*канал[ы]?(?![\\s\\w]*(?:телевизор|TV))|(?:канал[е]?\\s)?@\\w*(?!.*\\.)|канал\\s«\\w*»|канал[ы]?\\sв\\s(?:телеграм|telegram|tg|тг)|канал(?=[\\w\\s,.!\\.\\?\\-]*подписывай(?:тесь|ся))',
                                                                    '3.2'], ['Реклама товаров на маркетплейсах',
                                                                             '(?i)\\bлот\\b|артикул|скидк(?:и|ой)[\\s\\w]*до\\s[\\d]{1,2}%|распродажа|выгода\\s[\\d\\s]*\\s?₽|(?:(?<=цена)|(?<=выгод))[\\w\\s]*до\\s\\d{1,2}%',
                                                                             '2.1'],
    ['Реклама товаров на маркетплейсах',
     '(?i)\\bлот\\b|артикул|скидк(?:и|ой)[\\s\\w]*до\\s[\\d]{1,2}%|распродажа|выгода\\s[\\d\\s]*\\s?(?:₽|рублей|р)|(?:(?<=цена)|(?<=выгод))[\\w\\s\\!\\?\\,\\.]*до\\s\\d{1,2}%',
     '2.2'], ['Реклама товаров на маркетплейсах',
              '(?i)\\bлот\\b|артикул|скидк(?:и|ой)[\\s\\w]*до\\s[\\d]{1,2}%|распродажа|выгода\\s[\\d\\s]*\\s?(?:₽|рублей|р)|(?:(?<=цена)|(?<=выгод))[\\w\\s\\!\\?\\,\\.]*до\\s\\d{1,2}%|выгодная\\sцена',
              '3.0'], ['Реклама товаров на маркетплейсах',
                       '(?i)\\bлот\\b|артикул|скидк(?:и|ой)[\\s\\w]*до\\s[\\d]{1,2}%|распродажа|выгода\\s[\\d\\s]*\\s?(?:₽|рублей|р)|(?:(?<=цена)|(?<=выгод))[\\w\\s\\!\\?\\,\\.]*до\\s\\d{1,2}%|выгодн(?:ые|ым|ая)\\sцен(?:ы|ам|а)(?=[\\w\\s]*товар)|(?<=товар[ы])[\\s\\w]*выгодн(?:ые|ым|ая)\\sцен(?:ы|ам|а)|пора\\sскидок|скидка\\d{1,2}%|от\\s\\d+\\s?(?:₽|рублей|р)',
                       '4.0'], ['Реклама товаров на маркетплейсах',
                                '(?i)\\bлот\\b|артикул|скидк(?:и|ой)[\\s\\w]*до\\s[\\d]{1,2}%|распродажа|выгода\\s[\\d\\s]*\\s?(?:₽|рублей|р)|(?:(?<=цена)|(?<=выгод))[\\w\\s\\!\\?\\,\\.]*до\\s\\d{1,2}%|выгодн(?:ые|ым|ая)\\sцен(?:ы|ам|а)(?=[\\w\\s]*товар)|(?<=товар[ы])[\\s\\w]*выгодн(?:ые|ым|ая)\\sцен(?:ы|ам|а)|пора\\sскидок|скидка[\\s\\w]*\\d{1,2}%|(?:(?<=техника)|(?<=продукт)|(?<=товар)|(?<=аксессуар)|(?<=одежд))[\\s\\w]*от\\s\\d+\\s?(?:₽|рублей|р)',
                                '4.1'], ['Реклама товаров на маркетплейсах',
                                         '(?i)\\bлот\\b|артикул|скидк(?:и|ой)[\\s\\w]*до\\s[\\d]{1,2}%|распродажа|выгода\\s[\\d\\s]*\\s?(?:₽|рублей|р)|(?:(?<=цена)|(?<=выгод))[\\w\\s\\!\\?\\,\\.]*до\\s\\d{1,2}%|выгодн(?:ые|ым|ая)\\sцен(?:ы|ам|а)(?=[\\w\\s]*товар)|(?<=товар[ы])[\\s\\w]*выгодн(?:ые|ым|ая)\\sцен(?:ы|ам|а)|пора\\sскидок|скидка[\\s\\w]*\\d{1,2}%|(?:(?<=техника)|(?<=продукт)|(?<=товар)|(?<=аксессуар)|(?<=одежд))[\\s\\w]*от\\s\\d+\\s?(?:₽|рублей|р)|\\d+\\s?(?:₽|рублей|р)[\\s\\w\\!\\?\\.\\,\\-]*\\d{1,2}%\\sскидки|(?<=от)[\\w\\s]*по[\\s\\w]*цен(?:ам|е)',
                                         '5.0'], ['Реклама тг-каналов',
                                                  '(?i)(?:телеграм|telegram|tg|тг)[\\s-]канал[еы]?|t\\.me|(?<!ютуб[\\s-])канал(?:ы|ов)?\\s(?:с|про|по|для)\\b(?![\\s\\w]*телевизор)|на(?:ш[её]л|шла|йден)[\\s\\w]*канал[ы]?(?![\\s\\w]*(?:телевизор|TV))|(?:канал[е]?\\s)?@\\w*(?!.*\\.)|канал\\s«\\w*»|канал[ы]?\\sв\\s(?:телеграм|telegram|tg|тг)|канал(?=[\\w\\s,.!\\.\\?\\-]*подписывай(?:тесь|ся))|(?:\\w[\\w\\s])*\\s-\\sканал',
                                                  '4.0'], ['Реклама товаров на маркетплейсах',
                                                           '(?i)\\bлот\\b|артикул|скидк(?:и|ой)[\\s\\w]*до\\s[\\d]{1,2}%|распродажа|выгода\\s[\\d\\s]*\\s?(?:₽|рублей|р)|(?:(?<=цена)|(?<=выгод))[\\w\\s\\!\\?\\,\\.]*до\\s\\d{1,2}%|выгодн(?:ые|ым|ая)\\sцен(?:ы|ам|а)(?=[\\w\\s]*товар)|(?<=товар[ы])[\\s\\w]*выгодн(?:ые|ым|ая|ую)\\sцен(?:ы|ам|а|у)',
                                                           '3.2'], ['Реклама товаров на маркетплейсах',
                                                                    '(?i)\\bлот\\b|артикул|скидк(?:и|ой)[\\s\\w]*до\\s[\\d]{1,2}%|распродажа|выгода\\s[\\d\\s]*\\s?(?:₽|рублей|р)|(?:(?<=цена)|(?<=выгод))[\\w\\s\\!\\?\\,\\.]*до\\s\\d{1,2}%|выгодн(?:ые|ым|ая|ую)\\sцен(?:ы|ам|а|у)',
                                                                    '3.1'], ['Реклама товаров на маркетплейсах',
                                                                             '(?i)\\bлот\\b|артикул|скидк(?:и|ой)[\\s\\w]*до\\s[\\d]{1,2}%|распродажа|выгода\\s[\\d\\s]*\\s?(?:₽|рублей|р)|(?:(?<=цена)|(?<=выгод))[\\w\\s\\!\\?\\,\\.]*до\\s\\d{1,2}%|выгодн(?:ые|ым|ая)\\sцен(?:ы|ам|а)(?=[\\w\\s]*товар)|(?<=товар[ы])[\\s\\w]*выгодн(?:ые|ым|ая)\\sцен(?:ы|ам|а)|пора\\sскидок|скидка[\\s\\w]*\\d{1,2}%|(?:(?<=техника)|(?<=продукт)|(?<=товар)|(?<=аксессуар)|(?<=одежд))[\\s\\w]*от\\s\\d+\\s?(?:₽|рублей|р)|\\d+\\s?(?:₽|рублей|р)[\\s\\w\\!\\?\\.\\,\\-]*\\d{1,2}%\\sскидки|(?:(?<=от)|(?<=товар)|(?<=продукт))[\\w\\s]*по[\\s\\w]*цен(?:ам|е)',
                                                                             '5.1'], ['Реклама курсов',
                                                                                      '(?i)(?:бес)?платн(?:ые|ый|ых)\\s(?:мини)?курс(?:ы|ов|ам|а)?|(?:мини)?курс(?:е|ах)?\\s«[\\w\\-_0-9]*»|доступ\\s[\\s\\w]*(?:мини)?курс(?:ы|ов|ам|а|у)?|курс(?:ы|ов|ам|а)?\\s(?:по\\sссылке)|подар(?:ить|ок)\\sкурс(?:ы|ов)?|(?:мини)?курс[ы]?\\s(?:про|по)|онлайн[-\\s]курс(?:ы|ов|ам|а)?',
                                                                                      '3.1']
]

session = db_session.create_session()

for i in table_markers:
    a = RegularTable(marker=i[0], regular_expression=i[1], version=i[2])
    session.add(a)
    session.commit()

# Белый лист пользователей
users = []

for i in users:
    a = Users(tg_id=i)
    session.add(a)
    session.commit()